app/controllers/lineitems_controller.rb

  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_item(product.id)
    # @line_item = @cart.lineitems.build(product: product)
    # @line_item = LineItem.new(line_item_params)
    respond_to do |format|
      if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "lineitems" ("product_id", "cart_id", "created_at", "updated_at", "quantity", "order_id") VALUES (?, ?, ?, ?, ?, ?)  [["product_id", 1], ["cart_id", 16], ["created_at", "2022-12-09 03:38:34.998247"], ["updated_at", "2022-12-09 03:38:34.998247"], ["quantity", 1], ["order_id", nil]]
UPDATE "lineitems" SET "updated_at" = ?, "quantity" = ? WHERE "lineitems"."id" = ?  [["updated_at", "2022-12-09 03:38:49.106748"], ["quantity", 2], ["id", 2]]