app/controllers/shopper_controller.rb

  def index
    if params[:search]
      search_str = '%' + params[:search] + '%'
      result1 = Product.where('name like ?', search_str).order(:name)
      result2 = Product.where('description like ?', search_str).order(:description)
      result3 = Product.where('price like ?', search_str).order(:price)
      result = result1 + result2 + result3
      @products = result.uniq
    else
      @products = Product.order(:name)
---
SELECT "products".* FROM "products" WHERE (name like '%pro%') ORDER BY "products"."name" ASC
SELECT "products".* FROM "products" WHERE (description like '%pro%') ORDER BY "products"."description" ASC
SELECT "products".* FROM "products" WHERE (price like '%pro%') ORDER BY "products"."price" ASC