app/controllers/concerns/current_cart.rb

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2022-12-09 02:38:28.649363"], ["updated_at", "2022-12-09 02:38:28.649363"]]
---
	def set_cart
		@cart = Cart.find(session[:cart_id])
	rescue ActiveRecord::RecordNotFound
		@cart = Cart.create()